In [1]:
import numpy as np
import pandas as pd

# 5.5.1 层次化索引

In [32]:
ser = pd.Series(np.random.randn(10), 
               index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], \
                      [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
ser

a  1   -0.334392
   2    0.774579
   3   -1.794937
b  1   -0.106316
   2    0.798833
   3   -1.386883
c  1    0.171313
   2    0.121980
d  2   -0.761791
   3   -2.109171
dtype: float64

In [33]:
ser.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [34]:
ser['b']

1   -0.106316
2    0.798833
3   -1.386883
dtype: float64

In [35]:
ser[2] # 就是第二个  和索引中的数字无关

-1.7949365808062934

In [38]:
ser[[1, 2]]

a  2    0.774579
   3   -1.794937
dtype: float64

In [7]:
ser['b': 'd']

b  1    1.227190
   2   -0.941745
   3    1.547021
c  1    0.113233
   2    1.143737
d  2   -0.700452
   3    1.748646
dtype: float64

In [8]:
ser[['b', 'd']]

b  1    1.227190
   2   -0.941745
   3    1.547021
d  2   -0.700452
   3    1.748646
dtype: float64

In [9]:
ser

a  1    0.839905
   2   -0.883641
   3    0.649392
b  1    1.227190
   2   -0.941745
   3    1.547021
c  1    0.113233
   2    1.143737
d  2   -0.700452
   3    1.748646
dtype: float64

In [10]:
# 对 “内层” 选取
ser[:, 2]

a   -0.883641
b   -0.941745
c    1.143737
d   -0.700452
dtype: float64

In [11]:
ser.unstack()

          1         2         3
a  0.839905 -0.883641  0.649392
b  1.227190 -0.941745  1.547021
c  0.113233  1.143737       NaN
d       NaN -0.700452  1.748646

In [12]:
ser.unstack().stack()

a  1    0.839905
   2   -0.883641
   3    0.649392
b  1    1.227190
   2   -0.941745
   3    1.547021
c  1    0.113233
   2    1.143737
d  2   -0.700452
   3    1.748646
dtype: float64

#### stack() 与unstack()第七章详细介绍 相当重要

#### DataFrame的分层索引

In [13]:
df = pd.DataFrame(np.arange(12).reshape(4, 3),
                 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                 columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])
df

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [14]:
df.index.names = ["key1", 'key2']
df.columns.names = ["state", 'color']
df

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [15]:
df['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10